InformationRegisters/МероприятияТрудовойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>МероприятияТрудовойДеятельности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаМероприятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидМероприятия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМероприятийТрудовойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядКатегория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РазрядКатегорияДолжности</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоРееструДолжностей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудоваяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеФункции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокументаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеУвольнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУвольнения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяСовместителем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеВторогоДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВторогоДокументаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияВторогоДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВторогоДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЗанятий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТерриториальныеУсловия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриториальныеУсловияПФР</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаУвольненияПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныУвольненияПФР</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияТекстОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияСтатья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияЧасть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияПодпункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеУвольненияАбзац</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдМероприятия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЭлектронныеТрудовыеКнижкиКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура НаименованиеДокументаПриИзменении(Организация, ВидДокумента, НаименованиеДокумента) Экспорт
	
	ЭлектронныеТрудовыеКнижкиВызовСервера.НаименованиеДокументаПриИзмененииНаСервере(
		Организация, ВидДокумента, НаименованиеДокумента);
	
КонецПроцедуры

Процедура НаименованиеДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	ЗарплатаКадрыКлиент.ОткрытьФормуСпискаЗначенийСтроковогоРеквизита(Элемент,
		СтандартнаяОбработка, "НаименованиеДокументаТК", НСтр("ru = 'Наименования документов'"),
		НСтр("ru = 'Наименование документа'"));
	
КонецПроцедуры

Процедура НаименованиеДокументаОбработкаВыбора(Реквизит, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		Реквизит = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

Процедура НаименованиеДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	
	ЗарплатаКадрыКлиент.ПодборЗначенияСтроковогоРеквизита(Текст, ДанныеВыбора, СтандартнаяОбработка, "НаименованиеДокументаТК");
	
КонецПроцедуры

Процедура ОткрытьФормуВыбораОтправленныхСобытийФизическогоЛицаОрганизации(Владелец, ФизическоеЛицо, Организация, ДатаДокумента, ОписаниеОповещения = Неопределено) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация", Организация);
	ПараметрыОткрытия.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	ПараметрыОткрытия.Вставить("ДатаДокумента", ДатаДокумента);
	
	ОткрытьФорму("РегистрСведений.МероприятияТрудовойДеятельности.Форма.ФормаВыбораСобытий",
		ПараметрыОткрытия, Владелец, Истина, , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура СохранитьСТДРНаДиск(СсылкаНаДокумент, ДополнительныеПараметрыСохранения) Экспорт
	
	ДанныеФайловСТДР = ЭлектронныеТрудовыеКнижкиВызовСервера.ДанныеФайловСТДР(
		СсылкаНаДокумент, ДополнительныеПараметрыСохранения.Форма.УникальныйИдентификатор);
	
	Если ДанныеФайловСТДР.Количество() > 0
		И ЗначениеЗаполнено(ДанныеФайловСТДР[0].Ссылка) Тогда
		
		СохранитьПрисоединенныеФайлыСТДРНаДиск(ДанныеФайловСТДР);
		Возврат;
		
	КонецЕсли;
	
	ИспользоватьЭлектронныеПодписи = Ложь;
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
		ИспользоватьЭлектронныеПодписи = МодульЭлектроннаяПодписьКлиент.ИспользоватьЭлектронныеПодписи();
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СсылкаНаДокумент", СсылкаНаДокумент);
	ДополнительныеПараметры.Вставить("ДанныеФайловСТДР", ДанныеФайловСТДР);
	ДополнительныеПараметры.Вставить("ИдентификаторФормы", ДополнительныеПараметрыСохранения.Форма.УникальныйИдентификатор);
	
	Если Не ИспользоватьЭлектронныеПодписи Тогда
		
		Если ДанныеФайловСТДР.Количество() < 2 Тогда
			ТекстВопроса = НСтр("ru = 'Согласно порядку заполнения форма СТД-Р в электронном виде должна быть подписана усиленной квалифицированной электронной подписью.
				|На компьютере не используются средства для подписания файлов.
				|Сохранить не подписанный файл СТД-Р?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Согласно порядку заполнения форма СТД-Р в электронном виде должна быть подписана усиленной квалифицированной электронной подписью.
				|На компьютере не используются средства для подписания файлов.
				|Сохранить не подписанные файлы СТД-Р?'");
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("СохранитьСТДРНаДискБезИспользованияЭлектроннойПодписи",
			ЭлектронныеТрудовыеКнижкиКлиент, ДополнительныеПараметры);
		
		ПоказатьВопрос(Оповещение , ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	Иначе
		
		Если ДанныеФайловСТДР.Количество() < 2 Тогда
			ТекстВопроса = НСтр("ru = 'Согласно порядку заполнения форма СТД-Р в электронном виде должна быть подписана усиленной квалифицированной электронной подписью.
				|Подписать файл СТД-Р?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Согласно порядку заполнения форма СТД-Р в электронном виде должна быть подписана усиленной квалифицированной электронной подписью.
				|Подписать файлы СТД-Р?'");
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("СохранитьСТДРНаДискСИспользованиемЭлектроннойПодписи",
			ЭлектронныеТрудовыеКнижкиКлиент, ДополнительныеПараметры);
		
		ПоказатьВопрос(Оповещение , ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьСТДРНаДискБезИспользованияЭлектроннойПодписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьПрисоединенныеФайлыСТДРНаДиск(ДополнительныеПараметры.ДанныеФайловСТДР);
	
КонецПроцедуры

Процедура СохранитьСТДРНаДискСИспользованиемЭлектроннойПодписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если ДополнительныеПараметры.ДанныеФайловСТДР.Количество() < 2 Тогда
			Состояние(НСтр("ru = 'Выполняется подписание файла СТД-Р.'"));
		Иначе
			Состояние(НСтр("ru = 'Выполняется подписание файлов СТД-Р.'"));
		КонецЕсли;
		
		ДополнительныеПараметры.Вставить("ИндексФайла", 0);
		ПодписатьСТДР(ДополнительныеПараметры);
		
	Иначе
		СохранитьПрисоединенныеФайлыСТДРНаДиск(ДополнительныеПараметры.ДанныеФайловСТДР);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодписатьСТДР(ДополнительныеПараметры)
	
	ДанныеФайлаСТДР = ДополнительныеПараметры.ДанныеФайловСТДР[ДополнительныеПараметры.ИндексФайла];
	
	Оповещение = Новый ОписаниеОповещения("ПодписатьСледующийФайлСТДР", ЭтотОбъект, ДополнительныеПараметры);
	
	ИнтерфейсыВзаимодействияБРОКлиент.ПодписатьФайлXMLDSig(
		Оповещение, ДанныеФайлаСТДР.Организация, ДанныеФайлаСТДР.Хранение);
	
КонецПроцедуры

Процедура ПодписатьСледующийФайлСТДР(Результат, ДополнительныеПараметры) Экспорт
	
	ДанныеФайлаСТДР = ДополнительныеПараметры.ДанныеФайловСТДР[ДополнительныеПараметры.ИндексФайла];
	
	Если Результат <> Неопределено Тогда
		ДополнительныеПараметры.Вставить("ОповеститьОЗаписи", Истина);
		ДанныеФайлаСТДР.Хранение = Результат;
		ЭлектронныеТрудовыеКнижкиВызовСервера.ОбновитьФайлСТДР(
			ДополнительныеПараметры.СсылкаНаДокумент,
			ДанныеФайлаСТДР.Хранение,
			ДанныеФайлаСТДР.ИмяФайла,
			ДанныеФайлаСТДР.Ссылка);
	Иначе
		
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Не удалось подписать файл СТД-Р по организации %1'"),
			ДанныеФайлаСТДР.Организация);
		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		
	КонецЕсли;
	
	ДополнительныеПараметры.ИндексФайла = ДополнительныеПараметры.ИндексФайла + 1;
	Если ДополнительныеПараметры.ИндексФайла < ДополнительныеПараметры.ДанныеФайловСТДР.Количество() Тогда
		ПодписатьСТДР(ДополнительныеПараметры);
	Иначе
		Если ДополнительныеПараметры.Свойство("ОповеститьОЗаписи") Тогда
			ПрисоединенныеФайлы = Новый Массив;
			Для Каждого ДанныеФайлаСТДР Из ДополнительныеПараметры.ДанныеФайловСТДР Цикл
				Если ЗначениеЗаполнено(ДанныеФайлаСТДР.Ссылка) Тогда
					ПрисоединенныеФайлы.Добавить(ДанныеФайлаСТДР.Ссылка);
				КонецЕсли;
			КонецЦикла;
			Оповестить("ЗаписьФайлаСТДР", ПрисоединенныеФайлы, ДополнительныеПараметры.ИдентификаторФормы);
		КонецЕсли;
		СохранитьПрисоединенныеФайлыСТДРНаДиск(ДополнительныеПараметры.ДанныеФайловСТДР);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьРегистрациюОтменыМероприятий(Организация, ДанныеОтменяемыхМероприятий, ОписаниеОповещения = Неопределено) Экспорт
	
	Если ДанныеОтменяемыхМероприятий <> Неопределено
		И ДанныеОтменяемыхМероприятий.Количество() > 0 Тогда
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Организация", Организация);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ОтменяемыеМероприятия", ДанныеОтменяемыхМероприятий);
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.РегистрацияТрудовойДеятельности.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект,
			Истина, , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьРегистраторМероприятия(ДанныеРегистраторов, ОписаниеОповещения = Неопределено) Экспорт
	
	Если ДанныеРегистраторов <> Неопределено
		И ДанныеРегистраторов.Количество() > 0 Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Ключ", ДанныеРегистраторов[0].Регистратор);
		
		ИмяФормыДокумента = СтрШаблон(
			"Документ.%1.ФормаОбъекта",
			ЭлектронныеТрудовыеКнижкиВызовСервера.ИмяОбъектаМетаданных(ПараметрыОткрытия.Ключ));
		
		ОткрытьФорму(ИмяФормыДокумента, ПараметрыОткрытия, ЭтотОбъект, Истина, , ,
			ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьПрисоединенныеФайлыСТДРНаДиск(ДанныеФайловСТДР)
	
	ФайлыДляСохранения = Новый Массив;
	Для Каждого ДанныеФайла Из ДанныеФайловСТДР Цикл
		ФайлыДляСохранения.Добавить(Новый ОписаниеПередаваемогоФайла(
			ДанныеФайла.ИмяФайла + ".xml", ДанныеФайла.Хранение));
	КонецЦикла;
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайлов();
	ФайловаяСистемаКлиент.СохранитьФайлы(, ФайлыДляСохранения, ПараметрыСохранения);
	
КонецПроцедуры

#КонецОбласти
